# Taps
tap "aws/tap"
tap "azure/functions"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"

tap "mongodb/brew"

# Development
brew "aws/tap/aws-sam-cli"
brew "awscli"
brew "azure-cli"
brew "azure/functions/azure-functions-core-tools@4"
brew "bash"
brew "colima"
brew "gh"
brew "git-flow"
brew "git"
brew "neovim"
brew "tmux"
brew "tree"
brew "vim"

# Node
brew "node"
brew "node@14"
brew "nvm"

# PHP
brew "composer"
brew "php", link: false
brew "php@7.4", link: true

# Python
brew "python@3.10"
brew "python@3.8"
brew "python@3.9"

# Ruby
brew "ruby"

# Mongo DB
brew "mongocli"
brew "mongodb/brew/mongodb-community-shell"
brew "mongodb/brew/mongodb-community@4.4"
brew "mongodb/brew/mongodb-database-tools", link: false
brew "mongosh"

# Fonts
cask "font-fira-code-nerd-font"
cask "font-work-sans"
cask "font-open-sans"
cask "font-roboto"
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Command Line Utils
brew "bat"
brew "curl"
brew "fzf"
brew "mkcert"
brew "nnn"
brew "qt"
brew "youtube-dl"

# Apps
cask "alfred"
cask "app-cleaner"
cask "brave-browser"
cask "darktable"
cask "docker"
cask "google-chrome"
cask "iterm2"
cask "local"
cask "logitech-control-center"
cask "logitech-g-hub"
cask "microsoft-teams"
cask "mongodb-compass"
cask "notunes"
cask "obs"
cask "postman"
cask "rectangle"
cask "sketch"
cask "slack"
cask "spotify"
cask "the-unarchiver"
cask "visual-studio-code"
cask "vlc"
cask "wacom-tablet"
cask "zoom"

# fun
brew "cmatrix"

# unknown
brew "aom"
brew "freetds"
brew "gcc"
brew "gd"
brew "gdk-pixbuf"
brew "ghostscript"
brew "glib"
brew "gobject-introspection"
brew "harfbuzz"
brew "hdf5"
brew "htop"
brew "imagemagick"
brew "jpeg-xl"
brew "libavif"
brew "libexif"
brew "libgsf"
brew "libheif"
brew "libmatio"
brew "libpq"
brew "librsvg"
brew "libx11"
brew "luv"
brew "mozjpeg"
brew "nghttp2"
brew "openldap"
brew "openslide"
brew "pango"
brew "pkg-config"
brew "poppler"
brew "rustup-init"
brew "shared-mime-info"
brew "webp"
