# Taps
tap "aws/tap"
tap "azure/functions"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

tap "mongodb/brew"

# Development
brew "aws/tap/aws-sam-cli"
brew "awscli"
brew "azure-cli"
brew "azure/functions/azure-functions-core-tools@4"
brew "bash"
brew "colima"
brew "gh"
brew "git"
brew "neovim"
brew "tmux"
brew "tree"
brew "vim"

# Node
brew "nvm"

# PHP
brew "composer"
brew "php", link: false
brew "php@7.4", link: true

# Python
brew "python"

# Ruby
brew "ruby"

# Rust
brew "rustup-init"

# Go
brew "go"

# Mongo DB
brew "mongocli"
brew "mongodb/brew/mongodb-community-shell"
brew "mongodb/brew/mongodb-community@4.4"
brew "mongodb/brew/mongodb-database-tools", link: false
brew "mongosh"

# Fonts
cask "font-fira-code-nerd-font"
cask "font-work-sans"
cask "font-open-sans"
cask "font-roboto"
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Command Line Utils
brew "bat"
brew "curl"
brew "fzf"
brew "mkcert"
brew "nnn"
brew "qt"
brew "youtube-dl"

# Apps
cask "app-cleaner"
cask "brave-browser"
cask "docker"
cask "google-chrome"
cask "iterm2"
cask "local"
cask "logitech-control-center"
cask "logitech-g-hub"
cask "microsoft-teams"
cask "mongodb-compass"
cask "notunes"
cask "obs"
cask "postman"
cask "sketch"
cask "slack"
cask "spotify"
cask "the-unarchiver"
cask "visual-studio-code"
cask "vlc"
cask "wacom-tablet"
cask "zoom"

# unknown
brew "gcc"
brew "htop"
brew "imagemagick"
brew "webp"
