tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

tap "mongodb/brew"
tap "planetscale/tap"

brew "awscli"
brew "python@3.10"
brew "bash"
brew "bat"
brew "colima"
brew "curl"
brew "flyctl"
brew "fzf"
brew "gh"
brew "git"
brew "htop"
brew "imagemagick"
brew "jq"
brew "mkcert"
brew "mongocli"
brew "mongosh"
brew "neovim"
brew "nnn"
brew "pnpm"
brew "tmux"
brew "tree"
brew "vim"
brew "youtube-dl"

brew "mongodb/brew/mongodb-community-shell"
brew "mongodb/brew/mongodb-database-tools"
brew "mongodb/brew/mongodb-community@4.4"

brew "planetscale/tap/pscale"
cask "brave-browser"
cask "discord"
cask "docker"
cask "font-fira-code-nerd-font"
cask "font-work-sans"
cask "font-open-sans"
cask "font-roboto"
cask "google-chrome"
cask "iterm2"
cask "microsoft-teams"
cask "mongodb-compass"
cask "notunes"
cask "obs"
cask "postman"
cask "raycast"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "vlc"
cask "zoom"
